app/views/hearts/index.html.erb

SELECT "loves".* FROM "loves"
---
<script type="text/javascript">
$(function() {
	window.hearts = <%= Love.all.shuffle.to_json.html_safe %>;

  // for(var i = 0; i < 40; i++) {
  //   hearts.push({description: "love #" + i});
  // }


  // <%= @posts.to_json.html_safe -%>}
	window.router = new Heart.Routers.HeartsRouter({
    hearts: window.hearts
  });
	Backbone.history.start();
});